In [ ]:
Storage Engines
=================================

mysql> show engines;
+--------------------+---------+----------------------------------------------------------------+--------------+------+------------+
| Engine             | Support | Comment                                                        | Transactions | XA   | Savepoints |
+--------------------+---------+----------------------------------------------------------------+--------------+------+------------+
| FEDERATED          | NO      | Federated MySQL storage engine                                 | NULL         | NULL | NULL       |
| MEMORY             | YES     | Hash based, stored in memory, useful for temporary tables      | NO           | NO   | NO         |
| InnoDB             | DEFAULT | Supports transactions, row-level locking, and foreign keys     | YES          | YES  | YES        |
| PERFORMANCE_SCHEMA | YES     | Performance Schema                                             | NO           | NO   | NO         |
| MyISAM             | YES     | MyISAM storage engine                                          | NO           | NO   | NO         |
| MRG_MYISAM         | YES     | Collection of identical MyISAM tables                          | NO           | NO   | NO         |
| BLACKHOLE          | YES     | /dev/null storage engine (anything you write to it disappears) | NO           | NO   | NO         |
| CSV                | YES     | CSV storage engine                                             | NO           | NO   | NO         |
| ARCHIVE            | YES     | Archive storage engine                                         | NO           | NO   | NO         |
+--------------------+---------+----------------------------------------------------------------+--------------+------+------------+
9 rows

In [ ]:
Federated Storage Engine 
===================================

-- is used to create a table in one server that will point to a table in another mysql server.
-- this is similar to MS SqlServer linked server and orale database link.
-- the source and target table should have same column name , target can also be subset of source table.
-- the source table can be of any storage engine but the target/requestor table should be FEDRERATED engine.
-- this is disabled by default.


Enable Federated storage engine in Requestor server ( MySqlServer2 )
============================================================================

mysql> show engines;
+--------------------+---------+
| Engine             | Support |
+--------------------+---------+
| FEDERATED          | NO      |
| MEMORY             | YES     |
| InnoDB             | DEFAULT |

[root@MySqlServer2 plugin]# vi /etc/my.cnf
[root@MySqlServer2 plugin]# 
[root@MySqlServer2 plugin]# cat /etc/my.cnf | grep fed
federated
[root@MySqlServer2 plugin]# 
[root@MySqlServer2 plugin]# systemctl restart mysqld
[root@MySqlServer2 plugin]# 
[root@MySqlServer2 plugin]# mysqladmin ping
mysqld is alive
[root@MySqlServer2 plugin]# 

mysql> select engine , support , comment from information_schema.engines where engine like '%fed%';
+-----------+---------+--------------------------------+
| engine    | support | comment                        |
+-----------+---------+--------------------------------+
| FEDERATED | YES     | Federated MySQL storage engine |
+-----------+---------+--------------------------------+
1 row in set (0.00 sec)


In Source server create user for use in the link and create a table ( MySqlServer )
=========================================================================================

mysql> create table employee_details (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date,
    -> emp_email varchar(100)
    -> );

mysql> insert into employee_details values
    -> (1001 , 'vsdsad' , now() , 'dsadad@ggf.com'),
    -> (1002 , 'hfhgg' , now() , 'frjhgfhgjfg@sjhgfsdgf.com'),
    -> (1003 , 'yrhjrr' , now() , 'urrjkgg@fgdfhg.com');
Query OK, 3 rows affected, 3 warnings (0.01 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> create user 'link_user'@'%' identified by 'Link!2024';
Query OK, 0 rows affected (0.16 sec)

mysql> grant select on posdb.* to 'link_user'@'%';
Query OK, 0 rows affected (0.01 sec)


Create a table in requestor server ( MySqlServer2 ) and link to the source table 
=====================================================================================

create table employee_details (
emp_id int primary key,
emp_name varchar(100),
emp_dob date,
emp_email varchar(100)
) engine = federated
connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details'

Query OK, 0 rows affected (0.00 sec)

mysql> select @@hostname;
+--------------+
| @@hostname   |
+--------------+
| MySqlServer2 |
+--------------+
1 row in set (0.01 sec)

mysql> select * from employee_details;
+--------+----------+------------+---------------------------+
| emp_id | emp_name | emp_dob    | emp_email                 |
+--------+----------+------------+---------------------------+
|   1001 | vsdsad   | 2024-05-17 | dsadad@ggf.com            |
|   1002 | hfhgg    | 2024-05-17 | frjhgfhgjfg@sjhgfsdgf.com |
|   1003 | yrhjrr   | 2024-05-17 | urrjkgg@fgdfhg.com        |
+--------+----------+------------+---------------------------+
3 rows in set (0.01 sec)


mysql> select table_name , table_type , engine , table_rows from information_schema.tables 
where table_schema = 'stageposdb';
+------------------+------------+-----------+------------+
| TABLE_NAME       | TABLE_TYPE | ENGINE    | TABLE_ROWS |
+------------------+------------+-----------+------------+
| employee_details | BASE TABLE | FEDERATED |          3 |
+------------------+------------+-----------+------------+
1 row in set (0.00 sec)

mysql> select @@hostname;
+--------------+
| @@hostname   |
+--------------+
| MySqlServer2 |
+--------------+
1 row in set (0.00 sec)

mysql> insert into employee_details values ( 1004 , 'jhhagd' , now() , 'jhgdjfdf@yrwer.com' );
ERROR 1296 (HY000): Got error 10000 'Error on remote system: 1142: INSERT command denied 
to user 'link_user'@'192.168.153.134' for table ' from FEDERATED
mysql> 

mysql> select @@hostname;
+-------------+
| @@hostname  |
+-------------+
| mysqlserver |
+-------------+
1 row in set (0.20 sec)

mysql> grant insert on posdb.* to 'link_user'@'%';
Query OK, 0 rows affected (0.01 sec)

mysql> select @@hostname;
+--------------+
| @@hostname   |
+--------------+
| MySqlServer2 |
+--------------+
1 row in set (0.00 sec)

mysql> insert into employee_details values ( 1004 , 'jhhagd' , now() , 'jhgdjfdf@yrwer.com' );
ERROR 1296 (HY000): Got error 10000 'Error on remote system: 1142: INSERT command denied to 
user 'link_user'@'192.168.153.134' for table ' from FEDERATED

mysql> update employee_details set emp_name = 'Ranga' where emp_id = 1001;
ERROR 1296 (HY000): Got error 10000 'Error on remote system: 1142: UPDATE command denied to 
user 'link_user'@'192.168.153.134' for table ' from FEDERATED
mysql> 


create table with different name than the source table 
=================================================================

mysql> create table emp_details_federated (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date,
    -> emp_email varchar(100)
    -> ) engine = federated
    -> connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details';
Query OK, 0 rows affected (0.00 sec)

mysql> select * from emp_details_federated;
+--------+----------+------------+---------------------------+
| emp_id | emp_name | emp_dob    | emp_email                 |
+--------+----------+------------+---------------------------+
|   1001 | vsdsad   | 2024-05-17 | dsadad@ggf.com            |
|   1002 | hfhgg    | 2024-05-17 | frjhgfhgjfg@sjhgfsdgf.com |
|   1003 | yrhjrr   | 2024-05-17 | urrjkgg@fgdfhg.com        |
+--------+----------+------------+---------------------------+
3 rows in set (0.08 sec)


create table with subset of columns from source table 
===================================================================

mysql> create table emp_details_idname_federated (
    -> emp_id int primary key,
    -> emp_name varchar(100)
    -> ) engine = federated
    -> connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details';
Query OK, 0 rows affected (0.02 sec)

mysql> select * from emp_details_idname_federated;
+--------+----------+
| emp_id | emp_name |
+--------+----------+
|   1001 | vsdsad   |
|   1002 | hfhgg    |
|   1003 | yrhjrr   |
+--------+----------+
3 rows in set (0.29 sec)


create table with different column name than source table column 
=====================================================================

mysql> create table emp_details_updt_federated (
    -> employee_id int primary key,
    -> employee_name varchar(100)
    -> ) engine = federated
    -> connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details';
Query OK, 0 rows affected (0.00 sec)

mysql> select * from emp_details_updt_federated;
ERROR 1431 (HY000): The foreign data source you are trying to reference does not exist. Data source error:  error: 1054  'Unknown column 'employee_id' in 'field list''
mysql> 


create table without primary key in requestor server 
==========================================================

mysql> create table emp_details_updt_federated (
    -> emp_id int,
    -> emp_name varchar(100)
    -> ) engine = federated
    -> connection = 'mysql://link_user:Link!2024@192.168.153.133:3306/posdb/employee_details';
Query OK, 0 rows affected (0.00 sec)

mysql> select * from emp_details_updt_federated;
+--------+----------+
| emp_id | emp_name |
+--------+----------+
|   1001 | vsdsad   |
|   1002 | hfhgg    |
|   1003 | yrhjrr   |
+--------+----------+
3 rows in set (0.07 sec)


Insert data in the source table and check in target table 
=========================================================================

mysql> select @@hostname;
+-------------+
| @@hostname  |
+-------------+
| mysqlserver |
+-------------+

mysql> insert into employee_details values 
( 1004 , 'Ranga' , now() , 'Ranga@hdff.com' ), 
( 1005 , 'Changa' , now() , 'Changa@dvs.com' ), 
( 1006 , 'Sunga' , now() , 'Sunga@rewer.com' );

Query OK, 3 rows affected, 3 warnings (0.16 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> select @@hostname;
+--------------+
| @@hostname   |
+--------------+
| MySqlServer2 |
+--------------+
1 row in set (0.00 sec)

mysql> select table_name , table_type , engine , table_rows from information_schema.tables 
where table_schema = 'stageposdb';
+------------------------------+------------+-----------+------------+
| TABLE_NAME                   | TABLE_TYPE | ENGINE    | TABLE_ROWS |
+------------------------------+------------+-----------+------------+
| emp_details_federated        | BASE TABLE | FEDERATED |          3 |
| emp_details_idname_federated | BASE TABLE | FEDERATED |          3 |
| emp_details_updt_federated   | BASE TABLE | FEDERATED |          3 |
| employee_details             | BASE TABLE | FEDERATED |          3 |
+------------------------------+------------+-----------+------------+

mysql> select * from employee_details;
+--------+----------+------------+---------------------------+
| emp_id | emp_name | emp_dob    | emp_email                 |
+--------+----------+------------+---------------------------+
|   1001 | vsdsad   | 2024-05-17 | dsadad@ggf.com            |
|   1002 | hfhgg    | 2024-05-17 | frjhgfhgjfg@sjhgfsdgf.com |
|   1003 | yrhjrr   | 2024-05-17 | urrjkgg@fgdfhg.com        |
|   1004 | Ranga    | 2024-05-17 | Ranga@hdff.com            |
|   1005 | Changa   | 2024-05-17 | Changa@dvs.com            |
|   1006 | Sunga    | 2024-05-17 | Sunga@rewer.com           |
+--------+----------+------------+---------------------------+
6 rows in set (0.00 sec)

mysql> select * from emp_details_idname_federated;
+--------+----------+
| emp_id | emp_name |
+--------+----------+
|   1001 | vsdsad   |
|   1002 | hfhgg    |
|   1003 | yrhjrr   |
|   1004 | Ranga    |
|   1005 | Changa   |
|   1006 | Sunga    |
+--------+----------+
6 rows in set (0.01 sec)

In [ ]:
BlackHole Storage Engine
====================================

-- acts like a black hole , anything goes insides never comes back.
-- it is just like /dev/null in linux.


mysql> create table employee_salaries (
    -> emp_id int primary key,
    -> emp_salary numeric(6,2)
    -> ) engine = blackhole;
Query OK, 0 rows affected (0.05 sec)

mysql> insert into employee_salaries values ( 1001 , 3456.50 ) , ( 1002 , 5400.00 ) , ( 1003 , 4300.00);
Query OK, 3 rows affected (0.10 sec)
Records: 3  Duplicates: 0  Warnings: 0

mysql> select * from employee_salaries;
Empty set (0.00 sec)

mysql> create index idx_empsal_emp_sal on employee_salaries(emp_salary);
Query OK, 0 rows affected (0.09 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> update employee_salaries set emp_salary = 4200.00 where emp_id = 1001;
Query OK, 0 rows affected, 1 warning (0.01 sec)
Rows matched: 0  Changed: 0  Warnings: 1

mysql> delete from employee_salaries where emp_id = 1002;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> insert into employee_salaries values ( 1001 , 3456.50 ) , ( 1002 , 5400.00 ) , ( 1003 , 4300.00);
Query OK, 3 rows affected (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 0

[root@mysqlserver posdb]# pwd
/var/lib/mysql/posdb
[root@mysqlserver posdb]# ls -rtl *employee_sal*
-rw-r-----. 1 mysql mysql 3175 May 17 14:08 employee_salarie_387.sdi
[root@mysqlserver posdb]#

In [ ]:
Memory Storage Engine 
==========================================

-- data is stored in memory instead of disk hence fast retreival.
-- not persistent , data will be lost on server restart.
-- usefull for temporary tables.

mysql> create table emp_details (
    -> emp_id int primary key,
    -> emp_name varchar(50)
    -> ) engine = memory;
Query OK, 0 rows affected (0.40 sec)

mysql> insert into emp_details values ( 1001 , 'Ranga' ) , ( 1002 , 'Manga' );
Query OK, 2 rows affected (0.01 sec)
Records: 2  Duplicates: 0  Warnings: 0

mysql> select table_name , table_type , engine from information_schema.tables where table_schema = 'posdb';
+-------------------+------------+-----------+
| TABLE_NAME        | TABLE_TYPE | ENGINE    |
+-------------------+------------+-----------+
| emp_details       | BASE TABLE | MEMORY    |
| employee_details  | BASE TABLE | InnoDB    |
| employee_salaries | BASE TABLE | BLACKHOLE |
+-------------------+------------+-----------+
3 rows in set (0.00 sec)

mysql> create index idx_emp_details_empname on emp_details ( emp_name );
Query OK, 2 rows affected (0.10 sec)
Records: 2  Duplicates: 0  Warnings: 0

mysql> start transaction ;
Query OK, 0 rows affected (0.00 sec)

mysql> insert into emp_details values ( 1003 , 'Changa');
Query OK, 1 row affected (0.01 sec)

mysql> rollback;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> show warnings;
+---------+------+---------------------------------------------------------------+
| Level   | Code | Message                                                       |
+---------+------+---------------------------------------------------------------+
| Warning | 1196 | Some non-transactional changed tables couldn't be rolled back |
+---------+------+---------------------------------------------------------------+
1 row in set (0.00 sec)

mysql> select * from emp_details;
+--------+----------+
| emp_id | emp_name |
+--------+----------+
|   1001 | Ranga    |
|   1002 | Manga    |
|   1003 | Changa   |
+--------+----------+
3 rows in set (0.00 sec)


[root@mysqlserver ~]# systemctl restart mysqld
[root@mysqlserver ~]# 

[root@mysqlserver ~]# mysql
Welcome to the MySQL monitor.  Commands end with ; or \g.

mysql> use posdb;

Database changed

mysql> select table_name , table_type , engine from information_schema.tables where table_schema = 'posdb';
+-------------------+------------+-----------+
| TABLE_NAME        | TABLE_TYPE | ENGINE    |
+-------------------+------------+-----------+
| emp_details       | BASE TABLE | MEMORY    |
| employee_details  | BASE TABLE | InnoDB    |
| employee_salaries | BASE TABLE | BLACKHOLE |
+-------------------+------------+-----------+

mysql> select * from emp_details;
Empty set (0.00 sec)


[root@mysqlserver posdb]# pwd
/var/lib/mysql/posdb
[root@mysqlserver posdb]# ls -rtl *emp_det*
-rw-r-----. 1 mysql mysql 3167 May 17 17:09 emp_details_391.sdi
[root@mysqlserver posdb]#

In [ ]:
CSV storage engine 
==============================

-- stores table in text format with commas seperated values.
-- can be read and written by spreadsheet applications like excel.
-- does not support transactions and index.


mysql> create table employees (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date
    -> ) engine = csv;
ERROR 1069 (42000): Too many keys specified; max 0 keys allowed


mysql> create table employees (
    -> emp_id int ,
    -> emp_name varchar(100),
    -> emp_dob date
    -> ) engine = csv;
ERROR 1178 (42000): The storage engine for the table doesn't support nullable columns


mysql> create table employees (
    -> emp_id int not null,
    -> emp_name varchar(100) not null,
    -> emp_dob date not null
    -> ) engine = csv;

Query OK, 0 rows affected (0.08 sec)


mysql> insert into employees values 
    -> (1001 , 'Ranga' , now() ),
    -> (1002 , 'Manga' , now() ),
    -> (1003 , 'Changa' , now() );
Query OK, 3 rows affected, 3 warnings (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 3


mysql> select * from employees;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
+--------+----------+------------+
3 rows in set (0.00 sec)


[root@mysqlserver posdb]# ls -rtl *employees*
-rw-r-----. 1 mysql mysql 3752 May 17 23:08 employees_394.sdi
-rw-r-----. 1 mysql mysql   35 May 17 23:09 employees.CSM
-rw-r-----. 1 mysql mysql   79 May 17 23:09 employees.CSV
[root@mysqlserver posdb]# 


[root@mysqlserver posdb]# cat employees.CSV
1001,"Ranga","2024-05-17"
1002,"Manga","2024-05-17"
1003,"Changa","2024-05-17"
[root@mysqlserver posdb]# 

[root@mysqlserver posdb]# vi employees.CSV
[root@mysqlserver posdb]# 
[root@mysqlserver posdb]# cat employees.CSV
1001,"Ranga","2024-05-17"
1002,"Manga","2024-05-17"
1003,"Changa","2024-05-17"
1004,"Sunga","2024-05-17"
[root@mysqlserver posdb]# 


mysql> select * from employees;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
+--------+----------+------------+

mysql> flush tables;
Query OK, 0 rows affected (0.01 sec)

mysql> select * from employees;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
|   1004 | Sunga    | 2024-05-17 |
+--------+----------+------------+


mysql> \! ls -rtl *employees*
-rw-r-----. 1 mysql mysql 3752 May 17 23:08 employees_394.sdi
-rw-r-----. 1 mysql mysql  105 May 17 23:17 employees.CSV
-rw-r-----. 1 mysql mysql   35 May 17 23:18 employees.CSM

mysql> alter table employees add primary key ( emp_id );
ERROR 1069 (42000): Too many keys specified; max 0 keys allowed
mysql> 

mysql> create index idx_employees_empname on employees ( emp_name );
ERROR 1069 (42000): Too many keys specified; max 0 keys allowed
mysql> 

mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)

mysql> delete from employees where emp_id = 1004;
Query OK, 1 row affected (0.09 sec)

mysql> rollback;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> show warnings;
+---------+------+---------------------------------------------------------------+
| Level   | Code | Message                                                       |
+---------+------+---------------------------------------------------------------+
| Warning | 1196 | Some non-transactional changed tables couldn't be rolled back |
+---------+------+---------------------------------------------------------------+
1 row in set (0.01 sec)

mysql> select * from employees;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
+--------+----------+------------+
3 rows in set (0.00 sec)

In [ ]:
MyISAM storage engine 
==========================

-- My + ISAM - Indexed Sequence Access Method.
-- indexing algorithm developed by IBM used in faster retreival of large sets of data.
-- does not support transactions.

mysql> create table emp_details (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date
    -> ) engine = myisam;

Query OK, 0 rows affected (0.01 sec)


mysql> insert into emp_details values
    -> (1001,'Ranga',now()),
    -> (1002,'Manga',now()),
    -> (1003,'Changa',now()
    -> );

Query OK, 3 rows affected, 3 warnings (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> \! ls -rtl
total 12
-rw-r-----. 1 mysql mysql 3561 May 17 23:27 emp_details_395.sdi
-rw-r-----. 1 mysql mysql   60 May 17 23:28 emp_details.MYD
-rw-r-----. 1 mysql mysql 2048 May 17 23:28 emp_details.MYI
mysql> 

mysql> create index idx_emp_details_emp_name on emp_details ( emp_name );
Query OK, 3 rows affected (0.23 sec)
Records: 3  Duplicates: 0  Warnings: 0

mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)

mysql> insert into emp_details values (1004,'Sunga',now());
Query OK, 1 row affected, 1 warning (0.01 sec)

mysql> rollback;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> show warnings;
+---------+------+---------------------------------------------------------------+
| Level   | Code | Message                                                       |
+---------+------+---------------------------------------------------------------+
| Warning | 1196 | Some non-transactional changed tables couldn't be rolled back |
+---------+------+---------------------------------------------------------------+
1 row in set (0.00 sec)

mysql> select * from emp_details;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Manga    | 2024-05-17 |
|   1003 | Changa   | 2024-05-17 |
|   1004 | Sunga    | 2024-05-17 |
+--------+----------+------------+
4 rows in set (0.00 sec)

In [ ]:
Archive storage engine
====================================

-- stores table data in compressed format , .ARZ file.
-- uses gzip to compress rows.
-- No partitioning , No delete or update operation.
-- No index support.


mysql> create table emp_details ( 
    emp_id int primary key, 
    emp_name varchar(100), 
    emp_dob date ) engine = archive;

ERROR 1030 (HY000): Got error -1 - 'Unknown error -1' from storage engine

mysql> create table emp_details ( 
    emp_id int , 
    emp_name varchar(100), 
    emp_dob date ) engine = archive;

Query OK, 0 rows affected (0.19 sec)

mysql> insert into emp_details values
    -> (1001,'Ranga',now()),
    -> (1002,'Changa',now()),
    -> (1003,'Manga',now());

Query OK, 3 rows affected, 3 warnings (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> \! ls -rtl
total 8
-rw-r-----. 1 mysql mysql 3193 May 17 23:37 emp_details_399.sdi
-rw-r-----. 1 mysql mysql   88 May 17 23:37 emp_details.ARZ


mysql> update emp_details set emp_name = 'Sunga' where emp_id = 1002;
ERROR 1031 (HY000): Table storage engine for 'emp_details' doesn't have this option
mysql> 

mysql> delete from emp_details where emp_id = 1003;
ERROR 1031 (HY000): Table storage engine for 'emp_details' doesn't have this option
mysql> 


mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)

mysql> insert into emp_details values (1004,'Sunga',now());
Query OK, 1 row affected, 1 warning (0.00 sec)

mysql> rollback;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> show warnings;
+---------+------+---------------------------------------------------------------+
| Level   | Code | Message                                                       |
+---------+------+---------------------------------------------------------------+
| Warning | 1196 | Some non-transactional changed tables couldn't be rolled back |
+---------+------+---------------------------------------------------------------+
1 row in set (0.00 sec)

mysql> select * from emp_details;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Changa   | 2024-05-17 |
|   1003 | Manga    | 2024-05-17 |
|   1004 | Sunga    | 2024-05-17 |
+--------+----------+------------+
4 rows in set (0.00 sec)

In [ ]:
Innodb storage engine 
===============================

-- default storage engine , ACID complaint.
-- supports row level locking , indexing and transactions.
-- best for OLTP.

mysql> create table emp_details (
    -> emp_id int primary key,
    -> emp_name varchar(100),
    -> emp_dob date
    -> ) engine = innodb;

Query OK, 0 rows affected (0.03 sec)

mysql> insert into emp_details values 
    -> (1001,'Ranga',now()),
    -> (1002,'Changa',now()),
    -> (1003,'Manga',now());

Query OK, 3 rows affected, 3 warnings (0.00 sec)
Records: 3  Duplicates: 0  Warnings: 3

mysql> \! ls -rtl
total 112
-rw-r-----. 1 mysql mysql 114688 May 17 23:49 emp_details.ibd
mysql> 

mysql> start transaction;
Query OK, 0 rows affected (0.00 sec)

mysql> insert into emp_details values (1004,'Sunga',now());
Query OK, 1 row affected, 1 warning (0.00 sec)

mysql> rollback;
Query OK, 0 rows affected (0.00 sec)

mysql> select * from emp_details;
+--------+----------+------------+
| emp_id | emp_name | emp_dob    |
+--------+----------+------------+
|   1001 | Ranga    | 2024-05-17 |
|   1002 | Changa   | 2024-05-17 |
|   1003 | Manga    | 2024-05-17 |
+--------+----------+------------+
3 rows in set (0.01 sec)